%北师大博士论文，模拟赝热光源处的一阶关联函数，P30~P32  式（3.28），式（3.41）
% clear
% a1=5;%光源大小，单位为毫米
%      %数值参考中科大博士论文《基于纠缠光源的量子成像理论与实验研究》
%      %a1=5mm,a2=0.01mm时，二阶关联函数最明显
% for i=1:201
%    x1(i)=-0.1+0.001*(i-1);
%    x2(i)=x1(i);
% g(i)=exp(-(x1(i)^2+x2(i)^2)/(4*a1^2));%赝热光源处的一阶关联函数，式（3.41）,
%                                      %光源为有限大小但横向相干长度为零
% end 
% plot3(x1,x2,g);zlabel('赝热光源处光场的一阶关联函数')

% clear
% a1=5;%光源大小，单位为毫米
%      %数值参考中科大博士论文《基于纠缠光源的量子成像理论与实验研究》
%      %a1=5mm,a2=0.01mm时，二阶关联函数最明显
% for i=1:201
%    x1(i)=-0.1+0.001*(i-1);
% for j=1:201
%    x2(j)=-0.1+0.001*(j-1);
% g(i,j)=(exp(-(x1(i)^2+x2(j)^2)/(4*a1^2)))*dirac(x1(i)- x2(j));%赝热光源处的一阶关联函数，式（3.41）,
% end                                    %光源为有限大小但横向相干长度为零
% end 
% plot3(x1,x2,g);zlabel('赝热光源处光场的一阶关联函数')

clear
a1=5;%光源大小，单位为毫米
     %数值参考中科大博士论文《基于纠缠光源的量子成像理论与实验研究》
     %a1=5mm,a2=0.01mm时，二阶关联函数最明显
[x1,x2]=meshgrid(-0.1:0.001:0.1);
g=(exp(-(x1.^2+x2.^2)./(4.*a1.^2))).*dirac(x1-x2);%赝热光源处的一阶关联函数，式（3.41）,
                                                  %光源为有限大小但横向相干长度为零
mesh(x1,x2,g);zlabel('赝热光源处光场的一阶关联函数')


% clear
% a1=5;%光源大小，单位为毫米
% a2=0.01;%光源处光场的横向相干长度
% [x1,x2]=meshgrid(-0.1:0.001:0.1);
% g=(exp(-(x1.^2+x2.^2)./(4.*a1.^2))).*(exp(-(x1-x2).^2./(2.*a2.*a2)));%赝热光源处的一阶关联函数，式（3.28），光源为有限大小且横向相干长度不为零
% mesh(x1,x2,g);zlabel('赝热光源处光场的一阶关联函数')
